tests/two/load-test.yml
config:
  target: "http://localhost:3000"
  http:
    maxSockets: 5
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "run"
    flow:
      - get:
          url: "/decrypt"